{"keras_version": "1.0.8", "class_name": "Model", "config": {"input_layers": [["input", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input", "input_dtype": "float32", "batch_input_shape": [100, 784]}, "name": "input"}, {"class_name": "Dense", "inbound_nodes": [[["input", 0, 0]]], "config": {"activation": "relu", "name": "h", "input_dim": null, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "bias": true, "output_dim": 256, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "W_regularizer": null}, "name": "h"}, {"class_name": "Dense", "inbound_nodes": [[["h", 0, 0]]], "config": {"activation": "relu", "name": "z", "input_dim": null, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "bias": true, "output_dim": 2, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "W_regularizer": null}, "name": "z"}, {"class_name": "Dense", "inbound_nodes": [[["h", 0, 0]]], "config": {"activation": "linear", "name": "z_logalpha", "input_dim": null, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "bias": true, "output_dim": 2, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "W_regularizer": null}, "name": "z_logalpha"}, {"class_name": "Lambda", "inbound_nodes": [[["z", 0, 0], ["z_logalpha", 0, 0]]], "config": {"function_type": "lambda", "output_shape": "\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\b\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0019S)\u0002N\u00e9\u0000\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\finput_shapesr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\u001c./vae_information_dropout.py\u00da\b<lambda>+\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", "name": "noise_z", "output_shape_type": "lambda", "function": "\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0004\u0000\u0000\u0000\t\u0000\u0000\u0000C\u0000\u0000\u0000sM\u0000\u0000\u0000|\u0000\u0000\\\u0002\u0000}\u0001\u0000}\u0002\u0000t\u0000\u0000j\u0001\u0000t\u0000\u0000j\u0002\u0000d\u0001\u0000t\u0000\u0000j\u0003\u0000|\u0001\u0000\u0083\u0001\u0000d\u0002\u0000d\u0003\u0000d\u0004\u0000t\u0000\u0000j\u0001\u0000|\u0002\u0000\u0083\u0001\u0000\u0083\u0000\u0003\u0083\u0001\u0000}\u0003\u0000|\u0001\u0000|\u0003\u0000\u0014S)\u0005N\u00da\u0005shape\u00da\u0004mean\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u00da\u0003std)\u0004\u00da\u0001K\u00da\u0003exp\u00da\rrandom_normalr\u0001\u0000\u0000\u0000)\u0004\u00da\u0004args\u00da\u0001z\u00da\nz_logalpha\u00da\u0007epsilon\u00a9\u0000r\f\u0000\u0000\u0000\u00fa\u001c./vae_information_dropout.py\u00da\bsampling#\u0000\u0000\u0000s\b\u0000\u0000\u0000\u0000\u0001\f\u0002$\u0001\u0015\u0001", "arguments": {}, "trainable": true}, "name": "noise_z"}, {"class_name": "Dense", "inbound_nodes": [[["noise_z", 0, 0]]], "config": {"activation": "relu", "name": "decoder_h", "input_dim": null, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "bias": true, "output_dim": 256, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "W_regularizer": null}, "name": "decoder_h"}, {"class_name": "Dense", "inbound_nodes": [[["decoder_h", 0, 0]]], "config": {"activation": "sigmoid", "name": "decoder_x", "input_dim": null, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "bias": true, "output_dim": 784, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "W_regularizer": null}, "name": "decoder_x"}], "output_layers": [["decoder_x", 0, 0]], "name": "model_1"}}