{"class_name": "Model", "keras_version": "1.2.0", "config": {"input_layers": [["input", 0, 0]], "output_layers": [["softmax", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 96, 96], "name": "input", "sparse": false, "input_dtype": "float32"}, "name": "input"}, {"inbound_nodes": [[["input", 0, 0]]], "class_name": "Convolution2DwithOwnRegularizer", "config": {"W_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "nb_row": 3, "dim_ordering": "th", "border_mode": "same", "nb_col": 3, "bias": true, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "name": "block0-conv0", "nb_filter": 32, "activation": "linear", "trainable": true, "activity_regularizer": null}, "name": "block0-conv0"}, {"inbound_nodes": [[["block0-conv0", 0, 0]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "axis": 1, "momentum": 0.99, "name": "block0-bn0", "mode": 0, "beta_regularizer": null}, "name": "block0-bn0"}, {"inbound_nodes": [[["block0-bn0", 0, 0]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block0-relu0"}, "name": "block0-relu0"}, {"inbound_nodes": [[["block0-relu0", 0, 0]]], "class_name": "Convolution2DwithOwnRegularizer", "config": {"W_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "nb_row": 3, "dim_ordering": "th", "border_mode": "same", "nb_col": 3, "bias": true, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "name": "block0-conv1", "nb_filter": 32, "activation": "linear", "trainable": true, "activity_regularizer": null}, "name": "block0-conv1"}, {"inbound_nodes": [[["block0-conv1", 0, 0]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "axis": 1, "momentum": 0.99, "name": "block0-bn1", "mode": 0, "beta_regularizer": null}, "name": "block0-bn1"}, {"inbound_nodes": [[["block0-bn1", 0, 0]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block0-relu1"}, "name": "block0-relu1"}, {"inbound_nodes": [[["block0-relu1", 0, 0]]], "class_name": "Convolution2DwithOwnRegularizer", "config": {"W_regularizer": null, "b_regularizer": null, "subsample": [2, 2], "nb_row": 3, "dim_ordering": "th", "border_mode": "same", "nb_col": 3, "bias": true, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "name": "block0-conv2", "nb_filter": 32, "activation": "linear", "trainable": true, "activity_regularizer": null}, "name": "block0-conv2"}, {"inbound_nodes": [[["block0-conv2", 0, 0]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "axis": 1, "momentum": 0.99, "name": "block0-bn2", "mode": 0, "beta_regularizer": null}, "name": "block0-bn2"}, {"inbound_nodes": [[["block0-bn2", 0, 0]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block0-relu2"}, "name": "block0-relu2"}, {"inbound_nodes": [[["block0-relu1", 0, 0]]], "class_name": "Convolution2DwithOwnRegularizer", "config": {"W_regularizer": null, "b_regularizer": null, "subsample": [2, 2], "nb_row": 3, "dim_ordering": "th", "border_mode": "same", "nb_col": 3, "bias": true, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "name": "block0-logalpha", "nb_filter": 32, "activation": "linear", "trainable": true, "activity_regularizer": {"beta": 1.0, "name": "KLRegularizer"}}, "name": "block0-logalpha"}, {"inbound_nodes": [[["block0-relu2", 0, 0], ["block0-logalpha", 0, 0]]], "class_name": "Lambda", "config": {"output_shape_type": "lambda", "output_shape": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\b\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0019S)\u0002N\u00e9\u0000\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\finput_shapesr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000z\b./net.py\u00da\b<lambda>7\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "trainable": true, "arguments": {}, "name": "block0-z", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u000b\u0000\u0000\u0000S\u0000\u0000\u0000sh\u0000\u0000\u0000|\u0000\u0000\\\u0002\u0000}\u0001\u0000}\u0002\u0000t\u0000\u0000j\u0001\u0000t\u0000\u0000j\u0002\u0000d\u0001\u0000t\u0000\u0000j\u0003\u0000|\u0001\u0000\u0083\u0001\u0000d\u0002\u0000d\u0003\u0000d\u0004\u0000t\u0000\u0000j\u0004\u0000t\u0000\u0000j\u0001\u0000|\u0002\u0000\u0083\u0001\u0000d\u0005\u0000d\u0006\u0000\u0083\u0003\u0000\u0083\u0000\u0003\u0083\u0001\u0000}\u0003\u0000t\u0000\u0000j\u0005\u0000|\u0001\u0000|\u0003\u0000\u0014|\u0001\u0000\u0083\u0002\u0000S)\u0007N\u00da\u0005shape\u00da\u0004meang\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u00da\u0003std\u00e9\u0000\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?)\u0006\u00da\u0001K\u00da\u0003exp\u00da\rrandom_normalr\u0001\u0000\u0000\u0000\u00da\u0004clip\u00da\u000ein_train_phase)\u0004\u00da\u0004args\u00da\u0003f_x\u00da\blogalpha\u00da\u0007epsilon\u00a9\u0000r\u000e\u0000\u0000\u0000\u00fa\b./net.py\u00da\bsampling/\u0000\u0000\u0000s\b\u0000\u0000\u0000\u0000\u0001\f\u0003$\u0001$\u0001", null, null], "function_type": "lambda"}, "name": "block0-z"}, {"inbound_nodes": [[["block0-z", 0, 0]]], "class_name": "Convolution2DwithOwnRegularizer", "config": {"W_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "nb_row": 3, "dim_ordering": "th", "border_mode": "same", "nb_col": 3, "bias": true, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "name": "block1-conv0", "nb_filter": 64, "activation": "linear", "trainable": true, "activity_regularizer": null}, "name": "block1-conv0"}, {"inbound_nodes": [[["block1-conv0", 0, 0]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "axis": 1, "momentum": 0.99, "name": "block1-bn0", "mode": 0, "beta_regularizer": null}, "name": "block1-bn0"}, {"inbound_nodes": [[["block1-bn0", 0, 0]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block1-relu0"}, "name": "block1-relu0"}, {"inbound_nodes": [[["block1-relu0", 0, 0]]], "class_name": "Convolution2DwithOwnRegularizer", "config": {"W_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "nb_row": 3, "dim_ordering": "th", "border_mode": "same", "nb_col": 3, "bias": true, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "name": "block1-conv1", "nb_filter": 64, "activation": "linear", "trainable": true, "activity_regularizer": null}, "name": "block1-conv1"}, {"inbound_nodes": [[["block1-conv1", 0, 0]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "axis": 1, "momentum": 0.99, "name": "block1-bn1", "mode": 0, "beta_regularizer": null}, "name": "block1-bn1"}, {"inbound_nodes": [[["block1-bn1", 0, 0]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block1-relu1"}, "name": "block1-relu1"}, {"inbound_nodes": [[["block1-relu1", 0, 0]]], "class_name": "Convolution2DwithOwnRegularizer", "config": {"W_regularizer": null, "b_regularizer": null, "subsample": [2, 2], "nb_row": 3, "dim_ordering": "th", "border_mode": "same", "nb_col": 3, "bias": true, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "name": "block1-conv2", "nb_filter": 64, "activation": "linear", "trainable": true, "activity_regularizer": null}, "name": "block1-conv2"}, {"inbound_nodes": [[["block1-conv2", 0, 0]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "axis": 1, "momentum": 0.99, "name": "block1-bn2", "mode": 0, "beta_regularizer": null}, "name": "block1-bn2"}, {"inbound_nodes": [[["block1-bn2", 0, 0]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block1-relu2"}, "name": "block1-relu2"}, {"inbound_nodes": [[["block1-relu1", 0, 0]]], "class_name": "Convolution2DwithOwnRegularizer", "config": {"W_regularizer": null, "b_regularizer": null, "subsample": [2, 2], "nb_row": 3, "dim_ordering": "th", "border_mode": "same", "nb_col": 3, "bias": true, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "name": "block1-logalpha", "nb_filter": 64, "activation": "linear", "trainable": true, "activity_regularizer": {"beta": 1.0, "name": "KLRegularizer"}}, "name": "block1-logalpha"}, {"inbound_nodes": [[["block1-relu2", 0, 0], ["block1-logalpha", 0, 0]]], "class_name": "Lambda", "config": {"output_shape_type": "lambda", "output_shape": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\b\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0019S)\u0002N\u00e9\u0000\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\finput_shapesr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000z\b./net.py\u00da\b<lambda>7\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "trainable": true, "arguments": {}, "name": "block1-z", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u000b\u0000\u0000\u0000S\u0000\u0000\u0000sh\u0000\u0000\u0000|\u0000\u0000\\\u0002\u0000}\u0001\u0000}\u0002\u0000t\u0000\u0000j\u0001\u0000t\u0000\u0000j\u0002\u0000d\u0001\u0000t\u0000\u0000j\u0003\u0000|\u0001\u0000\u0083\u0001\u0000d\u0002\u0000d\u0003\u0000d\u0004\u0000t\u0000\u0000j\u0004\u0000t\u0000\u0000j\u0001\u0000|\u0002\u0000\u0083\u0001\u0000d\u0005\u0000d\u0006\u0000\u0083\u0003\u0000\u0083\u0000\u0003\u0083\u0001\u0000}\u0003\u0000t\u0000\u0000j\u0005\u0000|\u0001\u0000|\u0003\u0000\u0014|\u0001\u0000\u0083\u0002\u0000S)\u0007N\u00da\u0005shape\u00da\u0004meang\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u00da\u0003std\u00e9\u0000\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?)\u0006\u00da\u0001K\u00da\u0003exp\u00da\rrandom_normalr\u0001\u0000\u0000\u0000\u00da\u0004clip\u00da\u000ein_train_phase)\u0004\u00da\u0004args\u00da\u0003f_x\u00da\blogalpha\u00da\u0007epsilon\u00a9\u0000r\u000e\u0000\u0000\u0000\u00fa\b./net.py\u00da\bsampling/\u0000\u0000\u0000s\b\u0000\u0000\u0000\u0000\u0001\f\u0003$\u0001$\u0001", null, null], "function_type": "lambda"}, "name": "block1-z"}, {"inbound_nodes": [[["block1-z", 0, 0]]], "class_name": "Convolution2DwithOwnRegularizer", "config": {"W_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "nb_row": 3, "dim_ordering": "th", "border_mode": "same", "nb_col": 3, "bias": true, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "name": "block2-conv0", "nb_filter": 96, "activation": "linear", "trainable": true, "activity_regularizer": null}, "name": "block2-conv0"}, {"inbound_nodes": [[["block2-conv0", 0, 0]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "axis": 1, "momentum": 0.99, "name": "block2-bn0", "mode": 0, "beta_regularizer": null}, "name": "block2-bn0"}, {"inbound_nodes": [[["block2-bn0", 0, 0]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block2-relu0"}, "name": "block2-relu0"}, {"inbound_nodes": [[["block2-relu0", 0, 0]]], "class_name": "Convolution2DwithOwnRegularizer", "config": {"W_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "nb_row": 3, "dim_ordering": "th", "border_mode": "same", "nb_col": 3, "bias": true, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "name": "block2-conv1", "nb_filter": 96, "activation": "linear", "trainable": true, "activity_regularizer": null}, "name": "block2-conv1"}, {"inbound_nodes": [[["block2-conv1", 0, 0]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "axis": 1, "momentum": 0.99, "name": "block2-bn1", "mode": 0, "beta_regularizer": null}, "name": "block2-bn1"}, {"inbound_nodes": [[["block2-bn1", 0, 0]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block2-relu1"}, "name": "block2-relu1"}, {"inbound_nodes": [[["block2-relu1", 0, 0]]], "class_name": "Convolution2DwithOwnRegularizer", "config": {"W_regularizer": null, "b_regularizer": null, "subsample": [2, 2], "nb_row": 3, "dim_ordering": "th", "border_mode": "same", "nb_col": 3, "bias": true, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "name": "block2-conv2", "nb_filter": 96, "activation": "linear", "trainable": true, "activity_regularizer": null}, "name": "block2-conv2"}, {"inbound_nodes": [[["block2-conv2", 0, 0]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "axis": 1, "momentum": 0.99, "name": "block2-bn2", "mode": 0, "beta_regularizer": null}, "name": "block2-bn2"}, {"inbound_nodes": [[["block2-bn2", 0, 0]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block2-relu2"}, "name": "block2-relu2"}, {"inbound_nodes": [[["block2-relu1", 0, 0]]], "class_name": "Convolution2DwithOwnRegularizer", "config": {"W_regularizer": null, "b_regularizer": null, "subsample": [2, 2], "nb_row": 3, "dim_ordering": "th", "border_mode": "same", "nb_col": 3, "bias": true, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "name": "block2-logalpha", "nb_filter": 96, "activation": "linear", "trainable": true, "activity_regularizer": {"beta": 1.0, "name": "KLRegularizer"}}, "name": "block2-logalpha"}, {"inbound_nodes": [[["block2-relu2", 0, 0], ["block2-logalpha", 0, 0]]], "class_name": "Lambda", "config": {"output_shape_type": "lambda", "output_shape": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\b\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0019S)\u0002N\u00e9\u0000\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\finput_shapesr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000z\b./net.py\u00da\b<lambda>7\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "trainable": true, "arguments": {}, "name": "block2-z", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u000b\u0000\u0000\u0000S\u0000\u0000\u0000sh\u0000\u0000\u0000|\u0000\u0000\\\u0002\u0000}\u0001\u0000}\u0002\u0000t\u0000\u0000j\u0001\u0000t\u0000\u0000j\u0002\u0000d\u0001\u0000t\u0000\u0000j\u0003\u0000|\u0001\u0000\u0083\u0001\u0000d\u0002\u0000d\u0003\u0000d\u0004\u0000t\u0000\u0000j\u0004\u0000t\u0000\u0000j\u0001\u0000|\u0002\u0000\u0083\u0001\u0000d\u0005\u0000d\u0006\u0000\u0083\u0003\u0000\u0083\u0000\u0003\u0083\u0001\u0000}\u0003\u0000t\u0000\u0000j\u0005\u0000|\u0001\u0000|\u0003\u0000\u0014|\u0001\u0000\u0083\u0002\u0000S)\u0007N\u00da\u0005shape\u00da\u0004meang\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u00da\u0003std\u00e9\u0000\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?)\u0006\u00da\u0001K\u00da\u0003exp\u00da\rrandom_normalr\u0001\u0000\u0000\u0000\u00da\u0004clip\u00da\u000ein_train_phase)\u0004\u00da\u0004args\u00da\u0003f_x\u00da\blogalpha\u00da\u0007epsilon\u00a9\u0000r\u000e\u0000\u0000\u0000\u00fa\b./net.py\u00da\bsampling/\u0000\u0000\u0000s\b\u0000\u0000\u0000\u0000\u0001\f\u0003$\u0001$\u0001", null, null], "function_type": "lambda"}, "name": "block2-z"}, {"inbound_nodes": [[["block2-z", 0, 0]]], "class_name": "Convolution2DwithOwnRegularizer", "config": {"W_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "nb_row": 3, "dim_ordering": "th", "border_mode": "same", "nb_col": 3, "bias": true, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "name": "block3-conv0", "nb_filter": 192, "activation": "linear", "trainable": true, "activity_regularizer": null}, "name": "block3-conv0"}, {"inbound_nodes": [[["block3-conv0", 0, 0]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "axis": 1, "momentum": 0.99, "name": "block3-bn0", "mode": 0, "beta_regularizer": null}, "name": "block3-bn0"}, {"inbound_nodes": [[["block3-bn0", 0, 0]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block3-relu0"}, "name": "block3-relu0"}, {"inbound_nodes": [[["block3-relu0", 0, 0]]], "class_name": "Convolution2DwithOwnRegularizer", "config": {"W_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "nb_row": 3, "dim_ordering": "th", "border_mode": "same", "nb_col": 3, "bias": true, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "name": "block3-conv1", "nb_filter": 192, "activation": "linear", "trainable": true, "activity_regularizer": null}, "name": "block3-conv1"}, {"inbound_nodes": [[["block3-conv1", 0, 0]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "axis": 1, "momentum": 0.99, "name": "block3-bn1", "mode": 0, "beta_regularizer": null}, "name": "block3-bn1"}, {"inbound_nodes": [[["block3-bn1", 0, 0]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block3-relu1"}, "name": "block3-relu1"}, {"inbound_nodes": [[["block3-relu1", 0, 0]]], "class_name": "Convolution2DwithOwnRegularizer", "config": {"W_regularizer": null, "b_regularizer": null, "subsample": [2, 2], "nb_row": 3, "dim_ordering": "th", "border_mode": "same", "nb_col": 3, "bias": true, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "name": "block3-conv2", "nb_filter": 192, "activation": "linear", "trainable": true, "activity_regularizer": null}, "name": "block3-conv2"}, {"inbound_nodes": [[["block3-conv2", 0, 0]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "axis": 1, "momentum": 0.99, "name": "block3-bn2", "mode": 0, "beta_regularizer": null}, "name": "block3-bn2"}, {"inbound_nodes": [[["block3-bn2", 0, 0]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block3-relu2"}, "name": "block3-relu2"}, {"inbound_nodes": [[["block3-relu1", 0, 0]]], "class_name": "Convolution2DwithOwnRegularizer", "config": {"W_regularizer": null, "b_regularizer": null, "subsample": [2, 2], "nb_row": 3, "dim_ordering": "th", "border_mode": "same", "nb_col": 3, "bias": true, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "name": "block3-logalpha", "nb_filter": 192, "activation": "linear", "trainable": true, "activity_regularizer": {"beta": 1.0, "name": "KLRegularizer"}}, "name": "block3-logalpha"}, {"inbound_nodes": [[["block3-relu2", 0, 0], ["block3-logalpha", 0, 0]]], "class_name": "Lambda", "config": {"output_shape_type": "lambda", "output_shape": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\b\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0019S)\u0002N\u00e9\u0000\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\finput_shapesr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000z\b./net.py\u00da\b<lambda>7\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "trainable": true, "arguments": {}, "name": "block3-z", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u000b\u0000\u0000\u0000S\u0000\u0000\u0000sh\u0000\u0000\u0000|\u0000\u0000\\\u0002\u0000}\u0001\u0000}\u0002\u0000t\u0000\u0000j\u0001\u0000t\u0000\u0000j\u0002\u0000d\u0001\u0000t\u0000\u0000j\u0003\u0000|\u0001\u0000\u0083\u0001\u0000d\u0002\u0000d\u0003\u0000d\u0004\u0000t\u0000\u0000j\u0004\u0000t\u0000\u0000j\u0001\u0000|\u0002\u0000\u0083\u0001\u0000d\u0005\u0000d\u0006\u0000\u0083\u0003\u0000\u0083\u0000\u0003\u0083\u0001\u0000}\u0003\u0000t\u0000\u0000j\u0005\u0000|\u0001\u0000|\u0003\u0000\u0014|\u0001\u0000\u0083\u0002\u0000S)\u0007N\u00da\u0005shape\u00da\u0004meang\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u00da\u0003std\u00e9\u0000\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?)\u0006\u00da\u0001K\u00da\u0003exp\u00da\rrandom_normalr\u0001\u0000\u0000\u0000\u00da\u0004clip\u00da\u000ein_train_phase)\u0004\u00da\u0004args\u00da\u0003f_x\u00da\blogalpha\u00da\u0007epsilon\u00a9\u0000r\u000e\u0000\u0000\u0000\u00fa\b./net.py\u00da\bsampling/\u0000\u0000\u0000s\b\u0000\u0000\u0000\u0000\u0001\f\u0003$\u0001$\u0001", null, null], "function_type": "lambda"}, "name": "block3-z"}, {"inbound_nodes": [[["block3-z", 0, 0]]], "class_name": "Convolution2DwithOwnRegularizer", "config": {"W_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "nb_row": 3, "dim_ordering": "th", "border_mode": "same", "nb_col": 3, "bias": true, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "name": "block4-conv0", "nb_filter": 192, "activation": "linear", "trainable": true, "activity_regularizer": null}, "name": "block4-conv0"}, {"inbound_nodes": [[["block4-conv0", 0, 0]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "axis": 1, "momentum": 0.99, "name": "block4-bn0", "mode": 0, "beta_regularizer": null}, "name": "block4-bn0"}, {"inbound_nodes": [[["block4-bn0", 0, 0]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block4-relu0"}, "name": "block4-relu0"}, {"inbound_nodes": [[["block4-relu0", 0, 0]]], "class_name": "Convolution2DwithOwnRegularizer", "config": {"W_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "nb_row": 1, "dim_ordering": "th", "border_mode": "same", "nb_col": 1, "bias": true, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "name": "block4-conv1", "nb_filter": 192, "activation": "linear", "trainable": true, "activity_regularizer": null}, "name": "block4-conv1"}, {"inbound_nodes": [[["block4-conv1", 0, 0]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "axis": 1, "momentum": 0.99, "name": "block4-bn1", "mode": 0, "beta_regularizer": null}, "name": "block4-bn1"}, {"inbound_nodes": [[["block4-bn1", 0, 0]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block4-relu1"}, "name": "block4-relu1"}, {"inbound_nodes": [[["block4-relu1", 0, 0]]], "class_name": "Convolution2DwithOwnRegularizer", "config": {"W_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "nb_row": 1, "dim_ordering": "th", "border_mode": "same", "nb_col": 1, "bias": true, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "name": "block4-conv2", "nb_filter": 10, "activation": "linear", "trainable": true, "activity_regularizer": null}, "name": "block4-conv2"}, {"inbound_nodes": [[["block4-conv2", 0, 0]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "axis": 1, "momentum": 0.99, "name": "block4-bn2", "mode": 0, "beta_regularizer": null}, "name": "block4-bn2"}, {"inbound_nodes": [[["block4-bn2", 0, 0]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block4-relu2"}, "name": "block4-relu2"}, {"inbound_nodes": [[["block4-relu2", 0, 0]]], "class_name": "GlobalAveragePooling2D", "config": {"dim_ordering": "th", "trainable": true, "name": "spatial-average"}, "name": "spatial-average"}, {"inbound_nodes": [[["spatial-average", 0, 0]]], "class_name": "Lambda", "config": {"output_shape_type": "raw", "output_shape": null, "trainable": true, "arguments": {}, "name": "softmax", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\n\u0000\u0000\u0000t\u0000\u0000|\u0000\u0000\u0083\u0001\u0000S)\u0001N)\u0001\u00da\u0007softmax)\u0001\u00da\u0001x\u00a9\u0000r\u0003\u0000\u0000\u0000\u00fa\b./net.py\u00da\b<lambda>_\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda"}, "name": "softmax"}], "name": "All-CNN-96"}}