{"class_name": "Model", "keras_version": "1.2.0", "config": {"name": "All-CNN-96", "output_layers": [["softmax", 0, 0]], "input_layers": [["input", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input", "inbound_nodes": [], "config": {"input_dtype": "float32", "sparse": false, "name": "input", "batch_input_shape": [null, 1, 96, 96]}}, {"class_name": "Convolution2DwithOwnRegularizer", "name": "block0-conv0", "inbound_nodes": [[["input", 0, 0]]], "config": {"activation": "linear", "border_mode": "same", "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "nb_row": 3, "bias": true, "nb_filter": 32, "b_regularizer": null, "init": "glorot_uniform", "name": "block0-conv0", "trainable": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null}}, {"class_name": "BatchNormalization", "name": "block0-bn0", "inbound_nodes": [[["block0-conv0", 0, 0]]], "config": {"beta_regularizer": null, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "block0-bn0", "trainable": true, "gamma_regularizer": null, "axis": 1}}, {"class_name": "Activation", "name": "block0-relu0", "inbound_nodes": [[["block0-bn0", 0, 0]]], "config": {"activation": "relu", "name": "block0-relu0", "trainable": true}}, {"class_name": "Convolution2DwithOwnRegularizer", "name": "block0-conv1", "inbound_nodes": [[["block0-relu0", 0, 0]]], "config": {"activation": "linear", "border_mode": "same", "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "nb_row": 3, "bias": true, "nb_filter": 32, "b_regularizer": null, "init": "glorot_uniform", "name": "block0-conv1", "trainable": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null}}, {"class_name": "BatchNormalization", "name": "block0-bn1", "inbound_nodes": [[["block0-conv1", 0, 0]]], "config": {"beta_regularizer": null, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "block0-bn1", "trainable": true, "gamma_regularizer": null, "axis": 1}}, {"class_name": "Activation", "name": "block0-relu1", "inbound_nodes": [[["block0-bn1", 0, 0]]], "config": {"activation": "relu", "name": "block0-relu1", "trainable": true}}, {"class_name": "Convolution2DwithOwnRegularizer", "name": "block0-conv2", "inbound_nodes": [[["block0-relu1", 0, 0]]], "config": {"activation": "linear", "border_mode": "same", "dim_ordering": "th", "nb_col": 3, "subsample": [2, 2], "W_regularizer": null, "nb_row": 3, "bias": true, "nb_filter": 32, "b_regularizer": null, "init": "glorot_uniform", "name": "block0-conv2", "trainable": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null}}, {"class_name": "BatchNormalization", "name": "block0-bn2", "inbound_nodes": [[["block0-conv2", 0, 0]]], "config": {"beta_regularizer": null, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "block0-bn2", "trainable": true, "gamma_regularizer": null, "axis": 1}}, {"class_name": "Activation", "name": "block0-relu2", "inbound_nodes": [[["block0-bn2", 0, 0]]], "config": {"activation": "relu", "name": "block0-relu2", "trainable": true}}, {"class_name": "Convolution2DwithOwnRegularizer", "name": "block0-logalpha", "inbound_nodes": [[["block0-relu1", 0, 0]]], "config": {"activation": "linear", "border_mode": "same", "dim_ordering": "th", "nb_col": 3, "subsample": [2, 2], "W_regularizer": null, "nb_row": 3, "bias": true, "nb_filter": 32, "b_regularizer": null, "init": "glorot_uniform", "name": "block0-logalpha", "trainable": true, "activity_regularizer": {"name": "KLRegularizer", "beta": 0.009999999776482582}, "W_constraint": null, "b_constraint": null}}, {"class_name": "Lambda", "name": "block0-z", "inbound_nodes": [[["block0-relu2", 0, 0], ["block0-logalpha", 0, 0]]], "config": {"output_shape_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u000b\u0000\u0000\u0000S\u0000\u0000\u0000sh\u0000\u0000\u0000|\u0000\u0000\\\u0002\u0000}\u0001\u0000}\u0002\u0000t\u0000\u0000j\u0001\u0000t\u0000\u0000j\u0002\u0000d\u0001\u0000t\u0000\u0000j\u0003\u0000|\u0001\u0000\u0083\u0001\u0000d\u0002\u0000d\u0003\u0000d\u0004\u0000t\u0000\u0000j\u0004\u0000t\u0000\u0000j\u0001\u0000|\u0002\u0000\u0083\u0001\u0000d\u0005\u0000d\u0006\u0000\u0083\u0003\u0000\u0083\u0000\u0003\u0083\u0001\u0000}\u0003\u0000t\u0000\u0000j\u0005\u0000|\u0001\u0000|\u0003\u0000\u0014|\u0001\u0000\u0083\u0002\u0000S)\u0007N\u00da\u0005shape\u00da\u0004meang\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u00da\u0003std\u00e9\u0000\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?)\u0006\u00da\u0001K\u00da\u0003exp\u00da\rrandom_normalr\u0001\u0000\u0000\u0000\u00da\u0004clip\u00da\u000ein_train_phase)\u0004\u00da\u0004args\u00da\u0003f_x\u00da\blogalpha\u00da\u0007epsilon\u00a9\u0000r\u000e\u0000\u0000\u0000\u00fa=/home/nagano/work/keras-information-dropout/all_cnn_96/net.py\u00da\bsampling/\u0000\u0000\u0000s\b\u0000\u0000\u0000\u0000\u0001\f\u0003$\u0001$\u0001", null, null], "output_shape": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\b\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0019S)\u0002N\u00e9\u0000\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\finput_shapesr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa=/home/nagano/work/keras-information-dropout/all_cnn_96/net.py\u00da\b<lambda>7\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "name": "block0-z", "trainable": true, "function_type": "lambda", "arguments": {}}}, {"class_name": "Convolution2DwithOwnRegularizer", "name": "block1-conv0", "inbound_nodes": [[["block0-z", 0, 0]]], "config": {"activation": "linear", "border_mode": "same", "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "nb_row": 3, "bias": true, "nb_filter": 64, "b_regularizer": null, "init": "glorot_uniform", "name": "block1-conv0", "trainable": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null}}, {"class_name": "BatchNormalization", "name": "block1-bn0", "inbound_nodes": [[["block1-conv0", 0, 0]]], "config": {"beta_regularizer": null, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "block1-bn0", "trainable": true, "gamma_regularizer": null, "axis": 1}}, {"class_name": "Activation", "name": "block1-relu0", "inbound_nodes": [[["block1-bn0", 0, 0]]], "config": {"activation": "relu", "name": "block1-relu0", "trainable": true}}, {"class_name": "Convolution2DwithOwnRegularizer", "name": "block1-conv1", "inbound_nodes": [[["block1-relu0", 0, 0]]], "config": {"activation": "linear", "border_mode": "same", "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "nb_row": 3, "bias": true, "nb_filter": 64, "b_regularizer": null, "init": "glorot_uniform", "name": "block1-conv1", "trainable": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null}}, {"class_name": "BatchNormalization", "name": "block1-bn1", "inbound_nodes": [[["block1-conv1", 0, 0]]], "config": {"beta_regularizer": null, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "block1-bn1", "trainable": true, "gamma_regularizer": null, "axis": 1}}, {"class_name": "Activation", "name": "block1-relu1", "inbound_nodes": [[["block1-bn1", 0, 0]]], "config": {"activation": "relu", "name": "block1-relu1", "trainable": true}}, {"class_name": "Convolution2DwithOwnRegularizer", "name": "block1-conv2", "inbound_nodes": [[["block1-relu1", 0, 0]]], "config": {"activation": "linear", "border_mode": "same", "dim_ordering": "th", "nb_col": 3, "subsample": [2, 2], "W_regularizer": null, "nb_row": 3, "bias": true, "nb_filter": 64, "b_regularizer": null, "init": "glorot_uniform", "name": "block1-conv2", "trainable": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null}}, {"class_name": "BatchNormalization", "name": "block1-bn2", "inbound_nodes": [[["block1-conv2", 0, 0]]], "config": {"beta_regularizer": null, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "block1-bn2", "trainable": true, "gamma_regularizer": null, "axis": 1}}, {"class_name": "Activation", "name": "block1-relu2", "inbound_nodes": [[["block1-bn2", 0, 0]]], "config": {"activation": "relu", "name": "block1-relu2", "trainable": true}}, {"class_name": "Convolution2DwithOwnRegularizer", "name": "block1-logalpha", "inbound_nodes": [[["block1-relu1", 0, 0]]], "config": {"activation": "linear", "border_mode": "same", "dim_ordering": "th", "nb_col": 3, "subsample": [2, 2], "W_regularizer": null, "nb_row": 3, "bias": true, "nb_filter": 64, "b_regularizer": null, "init": "glorot_uniform", "name": "block1-logalpha", "trainable": true, "activity_regularizer": {"name": "KLRegularizer", "beta": 0.009999999776482582}, "W_constraint": null, "b_constraint": null}}, {"class_name": "Lambda", "name": "block1-z", "inbound_nodes": [[["block1-relu2", 0, 0], ["block1-logalpha", 0, 0]]], "config": {"output_shape_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u000b\u0000\u0000\u0000S\u0000\u0000\u0000sh\u0000\u0000\u0000|\u0000\u0000\\\u0002\u0000}\u0001\u0000}\u0002\u0000t\u0000\u0000j\u0001\u0000t\u0000\u0000j\u0002\u0000d\u0001\u0000t\u0000\u0000j\u0003\u0000|\u0001\u0000\u0083\u0001\u0000d\u0002\u0000d\u0003\u0000d\u0004\u0000t\u0000\u0000j\u0004\u0000t\u0000\u0000j\u0001\u0000|\u0002\u0000\u0083\u0001\u0000d\u0005\u0000d\u0006\u0000\u0083\u0003\u0000\u0083\u0000\u0003\u0083\u0001\u0000}\u0003\u0000t\u0000\u0000j\u0005\u0000|\u0001\u0000|\u0003\u0000\u0014|\u0001\u0000\u0083\u0002\u0000S)\u0007N\u00da\u0005shape\u00da\u0004meang\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u00da\u0003std\u00e9\u0000\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?)\u0006\u00da\u0001K\u00da\u0003exp\u00da\rrandom_normalr\u0001\u0000\u0000\u0000\u00da\u0004clip\u00da\u000ein_train_phase)\u0004\u00da\u0004args\u00da\u0003f_x\u00da\blogalpha\u00da\u0007epsilon\u00a9\u0000r\u000e\u0000\u0000\u0000\u00fa=/home/nagano/work/keras-information-dropout/all_cnn_96/net.py\u00da\bsampling/\u0000\u0000\u0000s\b\u0000\u0000\u0000\u0000\u0001\f\u0003$\u0001$\u0001", null, null], "output_shape": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\b\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0019S)\u0002N\u00e9\u0000\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\finput_shapesr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa=/home/nagano/work/keras-information-dropout/all_cnn_96/net.py\u00da\b<lambda>7\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "name": "block1-z", "trainable": true, "function_type": "lambda", "arguments": {}}}, {"class_name": "Convolution2DwithOwnRegularizer", "name": "block2-conv0", "inbound_nodes": [[["block1-z", 0, 0]]], "config": {"activation": "linear", "border_mode": "same", "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "nb_row": 3, "bias": true, "nb_filter": 96, "b_regularizer": null, "init": "glorot_uniform", "name": "block2-conv0", "trainable": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null}}, {"class_name": "BatchNormalization", "name": "block2-bn0", "inbound_nodes": [[["block2-conv0", 0, 0]]], "config": {"beta_regularizer": null, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "block2-bn0", "trainable": true, "gamma_regularizer": null, "axis": 1}}, {"class_name": "Activation", "name": "block2-relu0", "inbound_nodes": [[["block2-bn0", 0, 0]]], "config": {"activation": "relu", "name": "block2-relu0", "trainable": true}}, {"class_name": "Convolution2DwithOwnRegularizer", "name": "block2-conv1", "inbound_nodes": [[["block2-relu0", 0, 0]]], "config": {"activation": "linear", "border_mode": "same", "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "nb_row": 3, "bias": true, "nb_filter": 96, "b_regularizer": null, "init": "glorot_uniform", "name": "block2-conv1", "trainable": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null}}, {"class_name": "BatchNormalization", "name": "block2-bn1", "inbound_nodes": [[["block2-conv1", 0, 0]]], "config": {"beta_regularizer": null, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "block2-bn1", "trainable": true, "gamma_regularizer": null, "axis": 1}}, {"class_name": "Activation", "name": "block2-relu1", "inbound_nodes": [[["block2-bn1", 0, 0]]], "config": {"activation": "relu", "name": "block2-relu1", "trainable": true}}, {"class_name": "Convolution2DwithOwnRegularizer", "name": "block2-conv2", "inbound_nodes": [[["block2-relu1", 0, 0]]], "config": {"activation": "linear", "border_mode": "same", "dim_ordering": "th", "nb_col": 3, "subsample": [2, 2], "W_regularizer": null, "nb_row": 3, "bias": true, "nb_filter": 96, "b_regularizer": null, "init": "glorot_uniform", "name": "block2-conv2", "trainable": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null}}, {"class_name": "BatchNormalization", "name": "block2-bn2", "inbound_nodes": [[["block2-conv2", 0, 0]]], "config": {"beta_regularizer": null, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "block2-bn2", "trainable": true, "gamma_regularizer": null, "axis": 1}}, {"class_name": "Activation", "name": "block2-relu2", "inbound_nodes": [[["block2-bn2", 0, 0]]], "config": {"activation": "relu", "name": "block2-relu2", "trainable": true}}, {"class_name": "Convolution2DwithOwnRegularizer", "name": "block2-logalpha", "inbound_nodes": [[["block2-relu1", 0, 0]]], "config": {"activation": "linear", "border_mode": "same", "dim_ordering": "th", "nb_col": 3, "subsample": [2, 2], "W_regularizer": null, "nb_row": 3, "bias": true, "nb_filter": 96, "b_regularizer": null, "init": "glorot_uniform", "name": "block2-logalpha", "trainable": true, "activity_regularizer": {"name": "KLRegularizer", "beta": 0.009999999776482582}, "W_constraint": null, "b_constraint": null}}, {"class_name": "Lambda", "name": "block2-z", "inbound_nodes": [[["block2-relu2", 0, 0], ["block2-logalpha", 0, 0]]], "config": {"output_shape_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u000b\u0000\u0000\u0000S\u0000\u0000\u0000sh\u0000\u0000\u0000|\u0000\u0000\\\u0002\u0000}\u0001\u0000}\u0002\u0000t\u0000\u0000j\u0001\u0000t\u0000\u0000j\u0002\u0000d\u0001\u0000t\u0000\u0000j\u0003\u0000|\u0001\u0000\u0083\u0001\u0000d\u0002\u0000d\u0003\u0000d\u0004\u0000t\u0000\u0000j\u0004\u0000t\u0000\u0000j\u0001\u0000|\u0002\u0000\u0083\u0001\u0000d\u0005\u0000d\u0006\u0000\u0083\u0003\u0000\u0083\u0000\u0003\u0083\u0001\u0000}\u0003\u0000t\u0000\u0000j\u0005\u0000|\u0001\u0000|\u0003\u0000\u0014|\u0001\u0000\u0083\u0002\u0000S)\u0007N\u00da\u0005shape\u00da\u0004meang\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u00da\u0003std\u00e9\u0000\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?)\u0006\u00da\u0001K\u00da\u0003exp\u00da\rrandom_normalr\u0001\u0000\u0000\u0000\u00da\u0004clip\u00da\u000ein_train_phase)\u0004\u00da\u0004args\u00da\u0003f_x\u00da\blogalpha\u00da\u0007epsilon\u00a9\u0000r\u000e\u0000\u0000\u0000\u00fa=/home/nagano/work/keras-information-dropout/all_cnn_96/net.py\u00da\bsampling/\u0000\u0000\u0000s\b\u0000\u0000\u0000\u0000\u0001\f\u0003$\u0001$\u0001", null, null], "output_shape": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\b\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0019S)\u0002N\u00e9\u0000\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\finput_shapesr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa=/home/nagano/work/keras-information-dropout/all_cnn_96/net.py\u00da\b<lambda>7\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "name": "block2-z", "trainable": true, "function_type": "lambda", "arguments": {}}}, {"class_name": "Convolution2DwithOwnRegularizer", "name": "block3-conv0", "inbound_nodes": [[["block2-z", 0, 0]]], "config": {"activation": "linear", "border_mode": "same", "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "nb_row": 3, "bias": true, "nb_filter": 192, "b_regularizer": null, "init": "glorot_uniform", "name": "block3-conv0", "trainable": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null}}, {"class_name": "BatchNormalization", "name": "block3-bn0", "inbound_nodes": [[["block3-conv0", 0, 0]]], "config": {"beta_regularizer": null, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "block3-bn0", "trainable": true, "gamma_regularizer": null, "axis": 1}}, {"class_name": "Activation", "name": "block3-relu0", "inbound_nodes": [[["block3-bn0", 0, 0]]], "config": {"activation": "relu", "name": "block3-relu0", "trainable": true}}, {"class_name": "Convolution2DwithOwnRegularizer", "name": "block3-conv1", "inbound_nodes": [[["block3-relu0", 0, 0]]], "config": {"activation": "linear", "border_mode": "same", "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "nb_row": 3, "bias": true, "nb_filter": 192, "b_regularizer": null, "init": "glorot_uniform", "name": "block3-conv1", "trainable": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null}}, {"class_name": "BatchNormalization", "name": "block3-bn1", "inbound_nodes": [[["block3-conv1", 0, 0]]], "config": {"beta_regularizer": null, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "block3-bn1", "trainable": true, "gamma_regularizer": null, "axis": 1}}, {"class_name": "Activation", "name": "block3-relu1", "inbound_nodes": [[["block3-bn1", 0, 0]]], "config": {"activation": "relu", "name": "block3-relu1", "trainable": true}}, {"class_name": "Convolution2DwithOwnRegularizer", "name": "block3-conv2", "inbound_nodes": [[["block3-relu1", 0, 0]]], "config": {"activation": "linear", "border_mode": "same", "dim_ordering": "th", "nb_col": 3, "subsample": [2, 2], "W_regularizer": null, "nb_row": 3, "bias": true, "nb_filter": 192, "b_regularizer": null, "init": "glorot_uniform", "name": "block3-conv2", "trainable": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null}}, {"class_name": "BatchNormalization", "name": "block3-bn2", "inbound_nodes": [[["block3-conv2", 0, 0]]], "config": {"beta_regularizer": null, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "block3-bn2", "trainable": true, "gamma_regularizer": null, "axis": 1}}, {"class_name": "Activation", "name": "block3-relu2", "inbound_nodes": [[["block3-bn2", 0, 0]]], "config": {"activation": "relu", "name": "block3-relu2", "trainable": true}}, {"class_name": "Convolution2DwithOwnRegularizer", "name": "block3-logalpha", "inbound_nodes": [[["block3-relu1", 0, 0]]], "config": {"activation": "linear", "border_mode": "same", "dim_ordering": "th", "nb_col": 3, "subsample": [2, 2], "W_regularizer": null, "nb_row": 3, "bias": true, "nb_filter": 192, "b_regularizer": null, "init": "glorot_uniform", "name": "block3-logalpha", "trainable": true, "activity_regularizer": {"name": "KLRegularizer", "beta": 0.009999999776482582}, "W_constraint": null, "b_constraint": null}}, {"class_name": "Lambda", "name": "block3-z", "inbound_nodes": [[["block3-relu2", 0, 0], ["block3-logalpha", 0, 0]]], "config": {"output_shape_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u000b\u0000\u0000\u0000S\u0000\u0000\u0000sh\u0000\u0000\u0000|\u0000\u0000\\\u0002\u0000}\u0001\u0000}\u0002\u0000t\u0000\u0000j\u0001\u0000t\u0000\u0000j\u0002\u0000d\u0001\u0000t\u0000\u0000j\u0003\u0000|\u0001\u0000\u0083\u0001\u0000d\u0002\u0000d\u0003\u0000d\u0004\u0000t\u0000\u0000j\u0004\u0000t\u0000\u0000j\u0001\u0000|\u0002\u0000\u0083\u0001\u0000d\u0005\u0000d\u0006\u0000\u0083\u0003\u0000\u0083\u0000\u0003\u0083\u0001\u0000}\u0003\u0000t\u0000\u0000j\u0005\u0000|\u0001\u0000|\u0003\u0000\u0014|\u0001\u0000\u0083\u0002\u0000S)\u0007N\u00da\u0005shape\u00da\u0004meang\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u00da\u0003std\u00e9\u0000\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?)\u0006\u00da\u0001K\u00da\u0003exp\u00da\rrandom_normalr\u0001\u0000\u0000\u0000\u00da\u0004clip\u00da\u000ein_train_phase)\u0004\u00da\u0004args\u00da\u0003f_x\u00da\blogalpha\u00da\u0007epsilon\u00a9\u0000r\u000e\u0000\u0000\u0000\u00fa=/home/nagano/work/keras-information-dropout/all_cnn_96/net.py\u00da\bsampling/\u0000\u0000\u0000s\b\u0000\u0000\u0000\u0000\u0001\f\u0003$\u0001$\u0001", null, null], "output_shape": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\b\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0019S)\u0002N\u00e9\u0000\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\finput_shapesr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa=/home/nagano/work/keras-information-dropout/all_cnn_96/net.py\u00da\b<lambda>7\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "name": "block3-z", "trainable": true, "function_type": "lambda", "arguments": {}}}, {"class_name": "Convolution2DwithOwnRegularizer", "name": "block4-conv0", "inbound_nodes": [[["block3-z", 0, 0]]], "config": {"activation": "linear", "border_mode": "same", "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "nb_row": 3, "bias": true, "nb_filter": 192, "b_regularizer": null, "init": "glorot_uniform", "name": "block4-conv0", "trainable": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null}}, {"class_name": "BatchNormalization", "name": "block4-bn0", "inbound_nodes": [[["block4-conv0", 0, 0]]], "config": {"beta_regularizer": null, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "block4-bn0", "trainable": true, "gamma_regularizer": null, "axis": 1}}, {"class_name": "Activation", "name": "block4-relu0", "inbound_nodes": [[["block4-bn0", 0, 0]]], "config": {"activation": "relu", "name": "block4-relu0", "trainable": true}}, {"class_name": "Convolution2DwithOwnRegularizer", "name": "block4-conv1", "inbound_nodes": [[["block4-relu0", 0, 0]]], "config": {"activation": "linear", "border_mode": "same", "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "W_regularizer": null, "nb_row": 1, "bias": true, "nb_filter": 192, "b_regularizer": null, "init": "glorot_uniform", "name": "block4-conv1", "trainable": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null}}, {"class_name": "BatchNormalization", "name": "block4-bn1", "inbound_nodes": [[["block4-conv1", 0, 0]]], "config": {"beta_regularizer": null, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "block4-bn1", "trainable": true, "gamma_regularizer": null, "axis": 1}}, {"class_name": "Activation", "name": "block4-relu1", "inbound_nodes": [[["block4-bn1", 0, 0]]], "config": {"activation": "relu", "name": "block4-relu1", "trainable": true}}, {"class_name": "Convolution2DwithOwnRegularizer", "name": "block4-conv2", "inbound_nodes": [[["block4-relu1", 0, 0]]], "config": {"activation": "linear", "border_mode": "same", "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "W_regularizer": null, "nb_row": 1, "bias": true, "nb_filter": 10, "b_regularizer": null, "init": "glorot_uniform", "name": "block4-conv2", "trainable": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null}}, {"class_name": "BatchNormalization", "name": "block4-bn2", "inbound_nodes": [[["block4-conv2", 0, 0]]], "config": {"beta_regularizer": null, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "block4-bn2", "trainable": true, "gamma_regularizer": null, "axis": 1}}, {"class_name": "Activation", "name": "block4-relu2", "inbound_nodes": [[["block4-bn2", 0, 0]]], "config": {"activation": "relu", "name": "block4-relu2", "trainable": true}}, {"class_name": "GlobalAveragePooling2D", "name": "spatial-average", "inbound_nodes": [[["block4-relu2", 0, 0]]], "config": {"name": "spatial-average", "trainable": true, "dim_ordering": "th"}}, {"class_name": "Lambda", "name": "softmax", "inbound_nodes": [[["spatial-average", 0, 0]]], "config": {"output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\n\u0000\u0000\u0000t\u0000\u0000|\u0000\u0000\u0083\u0001\u0000S)\u0001N)\u0001\u00da\u0007softmax)\u0001\u00da\u0001x\u00a9\u0000r\u0003\u0000\u0000\u0000\u00fa=/home/nagano/work/keras-information-dropout/all_cnn_96/net.py\u00da\b<lambda>_\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "name": "softmax", "trainable": true, "function_type": "lambda", "arguments": {}}}]}}